src/Catalogs/MetadataObjectIDs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>MetadataObjectIDs</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CollectionOrder</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Comment>For example, TaskAddressingObjects</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullName</Name>
					<Comment>For example, ChartOfCharacteristicTypes.TaskAddressingObjects</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullSynonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WithoutData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmptyRefValue</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MetadataObjectKey</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewRef</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/MetadataObjectIDs/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

// Prevents metadata object IDs editing.
// Handles duplicates of the distributed infobase subordinate node.
//
Procedure BeforeWrite(Cancel)
	
	StandardSubsystemsCached.CatalogMetadataObjectIDsUsageCheck();
	
	// Disabling the object change record mechanism.
	AdditionalProperties.Insert("DisableObjectChangeRecordMechanism");
	
	// Recording object changes in all nodes DIB.
	For Each ExchangePlan In StandardSubsystemsCached.DIBExchangePlans() Do
		StandardSubsystemsServer.RecordObjectChangesInAllNodes(ThisObject, ExchangePlan);
	EndDo;
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not AdditionalProperties.Property("ExecutingAutomaticCatalogDataUpdate") Then
		
		If IsNew() Then
		
			RaiseByError(StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'Metadata object ID can be only created automatically
				           |during a catalog data update.'"),
				FullName));
				
		ElsIf Catalogs.MetadataObjectIDs.CannotChangeFullName(ThisObject) Then
			
			RaiseByError(StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'During metadata object ID change the full name 
				           |is specified as ""%1"". This name can only be
				           |set automatically during a catalog data update.'"),
				FullName));
		
		ElsIf Catalogs.MetadataObjectIDs.FullNameUsed(FullName, Ref) Then
			
			RaiseByError(StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'During metadata object ID change the full name 
				           |is specified as ""%1"". One of the catalog items 
 				          |already has this name.'"),
				FullName));
		
		EndIf;
		
		Catalogs.MetadataObjectIDs.UpdateIDProperties(ThisObject);
	EndIf;
	
	If CommonUse.IsSubordinateDIBNode() Then
		
		If IsNew()
		   And Not Catalogs.MetadataObjectIDs.IsCollection(GetNewObjectRef()) Then
			
			RaiseByError(
				NStr("en = 'Items can be added in the master node 
				           |of a distributed infobase only.'"));
		EndIf;
		
		If Not DeletionMark
		   And Not Catalogs.MetadataObjectIDs.IsCollection(Ref) Then
			
			If Upper(FullName) <> Upper(CommonUse.ObjectAttributeValue(Ref, "FullName")) Then
				RaiseByError(
					NStr("en = 'The full name can be changed in the master node 
				             |of a distributed infobase only.'"));
			EndIf;
		EndIf;
	EndIf;
	
EndProcedure

// Prevents deletion of metadata object IDs that are not marked for deletion.
Procedure BeforeDelete(Cancel)
	
	StandardSubsystemsCached.CatalogMetadataObjectIDsUsageCheck();
	
	// Disabling the  object change record mechanism.
	// ID references are deleted independently in all nodes
	// through the mechanisms of marking for deletion and marked object deletion.
	AdditionalProperties.Insert("DisableObjectChangeRecordMechanism");
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not DeletionMark Then
		RaiseByError(
			NStr("en = 'Cannot delete IDs of metadata objects whose ""Deletion mark""
                |attribute is set to False.'"));
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// AUXILIARY PROCEDURES AND FUNCTIONS

Procedure RaiseByError(ErrorText);
	
	Raise
		NStr("en = '""Metadata object IDs"" catalog error.'") + "
		           |
		           |" + ErrorText;
	
EndProcedure

#EndRegion

#EndIf
